Solver_Examples/PINNFoam/Run_Case/system/sampleCp
type            patchProbes;
libs            ("libsampling.so");
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);

