Solver_Examples/PINNFoam/Run_Case/Allrun
#!/bin/bash
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
runApplication blockMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
